[
 {
  "candidate_id": "cand_cg",
  "name_tokens": "Jesús “Chuy” García",
  "announcement_date": "10-Nov-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/governor-pat-quinn-endorses-congressman-jesus-chuy-garcia-for-mayor-of-chicago/",
  "title": "GOVERNOR PAT QUINN ENDORSES CONGRESSMAN JESÚS  “CHUY” GARCÍA FOR MAYOR OF CHICAGO",
  "text": "“This is big time. Pat Quinn embodies principled leadership and the people of Chicago trust his judgment. He knows the type of leader it takes to work across government and improve the lives of working Chicagoans. I’m honored to have his endorsement. ” said García. “19 days to go and our coalition continues to grow. I’m proud to have Governor Quinn on Team Chuy.Today’s endorsement adds to a growing list of elected leaders including Congresswoman Jan Schakowsky and Illinois House Majority Leader Robyn Gabel as well as more than a dozen labor organizations that are backing Chuy for Mayor.",
  "date": "2023-02-11"
 },
 {
  "candidate_id": "cand_cg",
  "name_tokens": "Jesus “Chuy” Garcia",
  "announcement_date": "10-Nov-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/governor-pat-quinn-endorses-congressman-jesus-chuy-garcia-for-mayor-of-chicago/",
  "title": "GOVERNOR PAT QUINN ENDORSES CONGRESSMAN JESÚS  “CHUY” GARCÍA FOR MAYOR OF CHICAGO",
  "text": "“This is big time. Pat Quinn embodies principled leadership and the people of Chicago trust his judgment. He knows the type of leader it takes to work across government and improve the lives of working Chicagoans. I’m honored to have his endorsement. ” said García. “19 days to go and our coalition continues to grow. I’m proud to have Governor Quinn on Team Chuy.Today’s endorsement adds to a growing list of elected leaders including Congresswoman Jan Schakowsky and Illinois House Majority Leader Robyn Gabel as well as more than a dozen labor organizations that are backing Chuy for Mayor.",
  "date": "2023-02-11"
 },
 {
  "candidate_id": "cand_cg",
  "name_tokens": "Chuy",
  "announcement_date": "10-Nov-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/governor-pat-quinn-endorses-congressman-jesus-chuy-garcia-for-mayor-of-chicago/",
  "title": "GOVERNOR PAT QUINN ENDORSES CONGRESSMAN JESÚS  “CHUY” GARCÍA FOR MAYOR OF CHICAGO",
  "text": "“This is big time. Pat Quinn embodies principled leadership and the people of Chicago trust his judgment. He knows the type of leader it takes to work across government and improve the lives of working Chicagoans. I’m honored to have his endorsement. ” said García. “19 days to go and our coalition continues to grow. I’m proud to have Governor Quinn on Team Chuy.Today’s endorsement adds to a growing list of elected leaders including Congresswoman Jan Schakowsky and Illinois House Majority Leader Robyn Gabel as well as more than a dozen labor organizations that are backing Chuy for Mayor.",
  "date": "2023-02-11"
 },
 {
  "candidate_id": "cand_cg",
  "name_tokens": "Chuy",
  "announcement_date": "10-Nov-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/congresswoman-jan-schakowsky-endorses-jesus-chuy-garcia-for-mayor/",
  "title": "CONGRESSWOMAN JAN SCHAKOWSKY ENDORSES JESÚS  “CHUY” GARCÍA FOR MAYOR",
  "text": "“Congresswoman Schakowsky is a Chicago legend and dedicated public servant. The people trust and respect the Congresswoman for her unparalleled record of service to our communities. She’s a fighter for climate and economic justice, a defender of democracy, and a champion of reproductive rights. When Jan Schakowsky speaks, Chicago listens, and I am incredibly honored to have her endorsement,” said García. “Our coalition is growing, and it’s built for victory. Today’s endorsement is confirmation of that.”",
  "date": "2023-01-25"
 },
 {
  "candidate_id": "cand_cg",
  "name_tokens": "Chuy",
  "announcement_date": "10-Nov-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-makes-case-for-second-term/",
  "title": "Mayor Lightfoot Makes Case For Second Term",
  "text": "Lightfoot is facing stiff competition with eight challengers – including six Black candidates – looking to unseat her after one full term in office on Election Day 2023 in Chicago on Tuesday, Feb. 28.“Why me as opposed to anyone else who is running? I’ll tell you why. Number one there’s no other Black candidate that has a shot of even getting into the runoff and is never going to see the inside of City Hall other than being invited as a guest,” said Lightfoot in her opening remarks. “That’s the truth. You can look at the polls, you can slice the numbers 20 ways from Sunday, but fundamentally any vote coming out of Black Chicago that’s not for Lori Lightfoot is giving it to [Paul] Villas or Chuy [Garcia].”The Defender joined journalists from The Chicago Crusader, N’DIGO, among other publications for a 90-minute sit-down conversation with the mayor held at the Chicago News Weekly office located at 8348 S. Stony Island Ave. in the city’s Avalon Park neighborhood. During the interview, Lightfoot addressed criticism levied against her by her political opponents, defended her record of accomplishments as mayor, discussed elements from her most recently passed budget, and more.The Defender recently participated in round-table interviews with mayoral candidate Cook County Commissioner Brandon Johnson and former Chicago Public Schools CEO and mayoral candidate Paul Vallas. (Interview questions and responses have been condensed for clarity and length.) Q: Do you support reparations for Black Chicago? If not, what does that look like?LIGHTFOOT: Reparations is called INVEST SOUTH/WEST. Reparations is called the procurement reforms that we’ve done to make sure that larger chunks of the city’s 3.5 billion dollars are going into Black and brown Chicago. Reparations is called the $31 million that we put into mostly Black Chicago through our targeted financial assistance, meaning $500 a month for 5,000 families for a year and helping them overcome the financial challenges that they have to make sure that when that pilot program is over, they’re in a better position than where they were before. Everything that I am doing is focused on equity and inclusion. Some people want to call it reparation. That’s fine. I call it building Black wealth. Q: What’s the plan moving forward for environmental issues in Chicago?LIGHTFOOT: Let me start with how much money that we’ve invested in all things environmental, specifically focused on environmental justice, 188 million dollars, the largest investment in environmental policy in concrete things in the history of the city. But let me step back. When I came into office, it wasn’t just that the prior administration disbanded theDepartment of Environment, we had stepped back from any leadership role, any environmental justice, environmental integrity, climate action, you name it. We were nowhere as a city… The other thing that we have done is make sure that we’re preserving Lake Michigan. It was very difficult to get done through the Trump Administration, but we finally got it done with the help of Senator Dick Durbin, which is to get the Army Corps of engineering to get the money to get for a study that is critical to doing the revetment work to stop the flooding that’s happening in areas of our city on the Far North Side, but also on the Far South Side that didn’t have that revetment for 20 some years. For example, every time there’s a storm on Lake Michigan, you can see the flooding three blocks in from the lake. Basements of buildings being flooded, cars being flooded, streets being flooded. We finally were able to get the work of revetment started. Q: You received $29 million from Congressman Danny Davis for health care training. We were talking about health care disparities. Have you had a chance to reflect on that and put minorities into the pipeline?LIGHTFOOT: So, a couple of things that we did along that line. I mentioned there were some silver linings, even in the very dark cloud of COVID. We knew that we needed to build up a community healthcare corps because I can come and knock on your door and you’re not going to answer. But if you’ve got a neighbor that you know and you trust, you’re going to open up that door. Not only are you going to open up that door, you’re going to have a conversation. And one of the biggest challenges that we faced during the first two years of COVID was getting people educated about the disease. We had to do a lot of myth busting. You may remember that a lot of Black folks said Black people can’t get COVID. The truth is the first person who died in our city was a middle-aged Black woman. We had to do a lot of work, but what we learned was we have to have troops on the ground who are trusted in the community to be able to get the message out, to be able to knock down people’s mess myths about the healthcare system and get them to be proactive about taking care of themselves. We couldn’t do that from the top down, we needed to do that at the block level. So, we hired 600 community health care workers in 2020 and mostly what they were doing initially was helping us reach out to educate, communicate, and the vast majority of them are Black and brown. I think an overwhelming number are Black. The idea wasn’t to just have 600 people that the city paid, but to get them real careers in health care and be that community healthcare force that we knew we were going to need on a going forward basis for public health. So, I think that that has been a tremendous success, but it’s given us insights that’s invaluable for us to know how we do service delivery. How do we reach people? How do we connect them up to services? We borrowed that model, if you will, from West Side United. Q: Do you support an elected school board?LIGHTFOOT: I do support an elected school board. I do not support the legislation that was passed. And I’m happy to spend another succession going chapter and verse on that, not in the least of which is they don’t account for that symbiotic financial relationship between the city and Chicago Public Schools (CPS). No one’s going to continue to pay what is in excess of half a billion dollars every year to CPS if they don’t have any say in the governance of CPS. I don’t give anybody money that I don’t have some say in how that money is being spent. Q: How much money has Chicago received in cannabis taxes? How has it been allocated?LIGHTFOOT: We get a tiny, tiny bit of cannabis money. It is three percent. That’s a conversation for another day whether or not that’s fair. I just happen to think it’s not. We getthree percent of the revenue for cannabis, and, as you know, the cannabis industry is just exploding. What are we doing with the money? We put it right back into violence interruption and prevention. All of those dollars are going there. Q: One thing that I am sure that is still on your list is the mental health situation. You promised to do something about mental health.LIGHTFOOT: Seventy-seven neighborhoods as of 2022 all have free mental health services.",
  "date": "2023-02-06"
 },
 {
  "candidate_id": "cand_cg",
  "name_tokens": "Chuy Garcia",
  "announcement_date": "10-Nov-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/governor-pat-quinn-endorses-congressman-jesus-chuy-garcia-for-mayor-of-chicago/",
  "title": "GOVERNOR PAT QUINN ENDORSES CONGRESSMAN JESÚS  “CHUY” GARCÍA FOR MAYOR OF CHICAGO",
  "text": "“This is big time. Pat Quinn embodies principled leadership and the people of Chicago trust his judgment. He knows the type of leader it takes to work across government and improve the lives of working Chicagoans. I’m honored to have his endorsement. ” said García. “19 days to go and our coalition continues to grow. I’m proud to have Governor Quinn on Team Chuy.Today’s endorsement adds to a growing list of elected leaders including Congresswoman Jan Schakowsky and Illinois House Majority Leader Robyn Gabel as well as more than a dozen labor organizations that are backing Chuy for Mayor.",
  "date": "2023-02-11"
 },
 {
  "candidate_id": "cand_cg",
  "name_tokens": "Chuy Garcia",
  "announcement_date": "10-Nov-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/congresswoman-jan-schakowsky-endorses-jesus-chuy-garcia-for-mayor/",
  "title": "CONGRESSWOMAN JAN SCHAKOWSKY ENDORSES JESÚS  “CHUY” GARCÍA FOR MAYOR",
  "text": "“Congresswoman Schakowsky is a Chicago legend and dedicated public servant. The people trust and respect the Congresswoman for her unparalleled record of service to our communities. She’s a fighter for climate and economic justice, a defender of democracy, and a champion of reproductive rights. When Jan Schakowsky speaks, Chicago listens, and I am incredibly honored to have her endorsement,” said García. “Our coalition is growing, and it’s built for victory. Today’s endorsement is confirmation of that.”",
  "date": "2023-01-25"
 },
 {
  "candidate_id": "cand_cg",
  "name_tokens": "Jesus “Chuy” García",
  "announcement_date": "10-Nov-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/governor-pat-quinn-endorses-congressman-jesus-chuy-garcia-for-mayor-of-chicago/",
  "title": "GOVERNOR PAT QUINN ENDORSES CONGRESSMAN JESÚS  “CHUY” GARCÍA FOR MAYOR OF CHICAGO",
  "text": "“This is big time. Pat Quinn embodies principled leadership and the people of Chicago trust his judgment. He knows the type of leader it takes to work across government and improve the lives of working Chicagoans. I’m honored to have his endorsement. ” said García. “19 days to go and our coalition continues to grow. I’m proud to have Governor Quinn on Team Chuy.Today’s endorsement adds to a growing list of elected leaders including Congresswoman Jan Schakowsky and Illinois House Majority Leader Robyn Gabel as well as more than a dozen labor organizations that are backing Chuy for Mayor.",
  "date": "2023-02-11"
 },
 {
  "candidate_id": "cand_cg",
  "name_tokens": "Jesús “Chuy” Garcia",
  "announcement_date": "10-Nov-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/governor-pat-quinn-endorses-congressman-jesus-chuy-garcia-for-mayor-of-chicago/",
  "title": "GOVERNOR PAT QUINN ENDORSES CONGRESSMAN JESÚS  “CHUY” GARCÍA FOR MAYOR OF CHICAGO",
  "text": "“This is big time. Pat Quinn embodies principled leadership and the people of Chicago trust his judgment. He knows the type of leader it takes to work across government and improve the lives of working Chicagoans. I’m honored to have his endorsement. ” said García. “19 days to go and our coalition continues to grow. I’m proud to have Governor Quinn on Team Chuy.Today’s endorsement adds to a growing list of elected leaders including Congresswoman Jan Schakowsky and Illinois House Majority Leader Robyn Gabel as well as more than a dozen labor organizations that are backing Chuy for Mayor.",
  "date": "2023-02-11"
 },
 {
  "candidate_id": "cand_bj",
  "name_tokens": "Brandon Johnson",
  "announcement_date": "27-Oct-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/ald-pat-dowell-chair-of-city-council-budget-committee-endorses-commissioner-brandon-johnson-for-mayor/",
  "title": "ALD. PAT DOWELL, CHAIR OF CITY COUNCIL BUDGET COMMITTEE, ENDORSES COMMISSIONER BRANDON JOHNSON FOR MAYOR",
  "text": "\n“This is the vision I will bring to the office of mayor of the city of Chicago, and I am tremendously honored and humbled to have her support.”The endorsement builds on the growing momentum of Commissioner Johnson’s campaign, and adds to the powerful coalition that he is building across the city. Johnson has been endorsed by unions, community organizations and elected leaders throughout Chicago, including U.S. Reps Delia Ramirez and Jonathan Jackson; Illinois state representatives Mary Flowers, Lilian Jimenez, Lakesia Collins and Will Guzzardi; Cook County commissioners Bill Lowry, Stanley Moore, Anthony Quezada and Josina Morita; Alderpeople Daniel LaSpata, Jeanette Taylor, Byron Sigcho-Lopez, Rossana Rodríguez-Sanchez and Carlos Ramirez-Rosa; the American Federation of Teachers, Illinois Federation of Teachers, Chicago Teachers Union, SEIU Local 73, SEIU Healthcare, Cook County College Teachers Union and AFT Local 943; and United Working Families, People United for Action, United Northwest Side, ONE People’s Campaign, 11th Ward IPO, 25th Ward IPO, 30th United Chicago, 33rd Ward Working Families, 39th Ward Neighbors United, United Neighbors of the 35th ward, 48th Ward Neighbors for Justice, Better Streets Chicago Action Fund and more. ",
  "date": "2023-02-03"
 },
 {
  "candidate_id": "cand_bj",
  "name_tokens": "Brandon Johnson",
  "announcement_date": "27-Oct-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/working-families-party-endorses-brandon-johnson-for-mayor-of-chicago/",
  "title": "WORKING FAMILIES PARTY ENDORSES   BRANDON JOHNSON FOR MAYOR OF CHICAGO",
  "text": "“We are proud to endorse Brandon today, because his lived experience, his history of service and his dedication to the people make him the ideal candidate for mayor.”With this endorsement, WFP seeks to bring a real progressive leader to the city committed to advancing economic justice, championing public safety and bringing to an end to years of fiscal mismanagement. “I’m honored to receive the support of the Working Families Party,” Commissioner Johnson said. “It’s time for new leadership in the city of Chicago because the politics of old have left us behind.“I’m ready to bring the people to the fifth floor of City Hall, and usher in a new dawn of innovative and progressive policies that put communities first. I’m grateful for WFP’s support, and I look forward to collaborating with them once elected.”The endorsement builds on the growing momentum of Commissioner Johnson’s campaign, and adds to the powerful coalition that Johnson is building across the city. Johnson has been endorsed by unions, community organizations and elected leaders throughout Chicago, including U.S. Reps Delia Ramirez and Jonathan Jackson, Illinois state representatives Lilian Jimenez, Lakesia Collins and Will Guzzardi, Cook County commissioners Anthony Quezada and Josina Morita, Alderpeople Daniel LaSpata, Jeanette Taylor, Byron Sigcho-Lopez, Rossana Rodríguez-Sanchez, Carlos Ramirez-Rosa, American Federation of Teachers, Illinois Federation of Teachers, Chicago Teachers Union, SEIU Local 73, SEIU Healthcare, Cook County College Teachers Union, AFT Local 943, United Working Families, People United for Action, United Northwest Side, ONE People’s Campaign, 25th Ward IPO, 30th United Chicago, 33rd Ward Working Families, 39th Ward Neighbors United, United Neighbors of the 35th ward, 48th Ward Neighbors for Justice and more. ",
  "date": "2023-01-31"
 },
 {
  "candidate_id": "cand_bj",
  "name_tokens": "Brandon Johnson",
  "announcement_date": "27-Oct-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/one-peoples-campaign-endorses-brandon-johnson-for-mayor/",
  "title": "ONE People’s Campaign Endorses Brandon Johnson for Mayor",
  "text": "This endorsement joins a slate of other endorsements by ONE People’s Campaign for the 2023 election. They have previously endorsed Andre Vasquez (40th Ward Alderman), Matt Martin (47th Ward Alderman), and Maria Hadden (49th Ward Alderwoman) for re-election. They have also endorsed Mueze Bawany and Angela Clay for the open Alderperson positions in the 50th and 46th Wards, respectively. ONE People’s Campaign is also actively working to educate voters about the newly-created District Council positions, and has endorsed candidates in four districts.",
  "date": "2023-01-25"
 },
 {
  "candidate_id": "cand_bj",
  "name_tokens": "Brandon Johnson",
  "announcement_date": "27-Oct-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-makes-case-for-second-term/",
  "title": "Mayor Lightfoot Makes Case For Second Term",
  "text": "Lightfoot is facing stiff competition with eight challengers – including six Black candidates – looking to unseat her after one full term in office on Election Day 2023 in Chicago on Tuesday, Feb. 28.“Why me as opposed to anyone else who is running? I’ll tell you why. Number one there’s no other Black candidate that has a shot of even getting into the runoff and is never going to see the inside of City Hall other than being invited as a guest,” said Lightfoot in her opening remarks. “That’s the truth. You can look at the polls, you can slice the numbers 20 ways from Sunday, but fundamentally any vote coming out of Black Chicago that’s not for Lori Lightfoot is giving it to [Paul] Villas or Chuy [Garcia].”The Defender joined journalists from The Chicago Crusader, N’DIGO, among other publications for a 90-minute sit-down conversation with the mayor held at the Chicago News Weekly office located at 8348 S. Stony Island Ave. in the city’s Avalon Park neighborhood. During the interview, Lightfoot addressed criticism levied against her by her political opponents, defended her record of accomplishments as mayor, discussed elements from her most recently passed budget, and more.The Defender recently participated in round-table interviews with mayoral candidate Cook County Commissioner Brandon Johnson and former Chicago Public Schools CEO and mayoral candidate Paul Vallas. (Interview questions and responses have been condensed for clarity and length.) Q: Do you support reparations for Black Chicago? If not, what does that look like?LIGHTFOOT: Reparations is called INVEST SOUTH/WEST. Reparations is called the procurement reforms that we’ve done to make sure that larger chunks of the city’s 3.5 billion dollars are going into Black and brown Chicago. Reparations is called the $31 million that we put into mostly Black Chicago through our targeted financial assistance, meaning $500 a month for 5,000 families for a year and helping them overcome the financial challenges that they have to make sure that when that pilot program is over, they’re in a better position than where they were before. Everything that I am doing is focused on equity and inclusion. Some people want to call it reparation. That’s fine. I call it building Black wealth. Q: What’s the plan moving forward for environmental issues in Chicago?LIGHTFOOT: Let me start with how much money that we’ve invested in all things environmental, specifically focused on environmental justice, 188 million dollars, the largest investment in environmental policy in concrete things in the history of the city. But let me step back. When I came into office, it wasn’t just that the prior administration disbanded theDepartment of Environment, we had stepped back from any leadership role, any environmental justice, environmental integrity, climate action, you name it. We were nowhere as a city… The other thing that we have done is make sure that we’re preserving Lake Michigan. It was very difficult to get done through the Trump Administration, but we finally got it done with the help of Senator Dick Durbin, which is to get the Army Corps of engineering to get the money to get for a study that is critical to doing the revetment work to stop the flooding that’s happening in areas of our city on the Far North Side, but also on the Far South Side that didn’t have that revetment for 20 some years. For example, every time there’s a storm on Lake Michigan, you can see the flooding three blocks in from the lake. Basements of buildings being flooded, cars being flooded, streets being flooded. We finally were able to get the work of revetment started. Q: You received $29 million from Congressman Danny Davis for health care training. We were talking about health care disparities. Have you had a chance to reflect on that and put minorities into the pipeline?LIGHTFOOT: So, a couple of things that we did along that line. I mentioned there were some silver linings, even in the very dark cloud of COVID. We knew that we needed to build up a community healthcare corps because I can come and knock on your door and you’re not going to answer. But if you’ve got a neighbor that you know and you trust, you’re going to open up that door. Not only are you going to open up that door, you’re going to have a conversation. And one of the biggest challenges that we faced during the first two years of COVID was getting people educated about the disease. We had to do a lot of myth busting. You may remember that a lot of Black folks said Black people can’t get COVID. The truth is the first person who died in our city was a middle-aged Black woman. We had to do a lot of work, but what we learned was we have to have troops on the ground who are trusted in the community to be able to get the message out, to be able to knock down people’s mess myths about the healthcare system and get them to be proactive about taking care of themselves. We couldn’t do that from the top down, we needed to do that at the block level. So, we hired 600 community health care workers in 2020 and mostly what they were doing initially was helping us reach out to educate, communicate, and the vast majority of them are Black and brown. I think an overwhelming number are Black. The idea wasn’t to just have 600 people that the city paid, but to get them real careers in health care and be that community healthcare force that we knew we were going to need on a going forward basis for public health. So, I think that that has been a tremendous success, but it’s given us insights that’s invaluable for us to know how we do service delivery. How do we reach people? How do we connect them up to services? We borrowed that model, if you will, from West Side United. Q: Do you support an elected school board?LIGHTFOOT: I do support an elected school board. I do not support the legislation that was passed. And I’m happy to spend another succession going chapter and verse on that, not in the least of which is they don’t account for that symbiotic financial relationship between the city and Chicago Public Schools (CPS). No one’s going to continue to pay what is in excess of half a billion dollars every year to CPS if they don’t have any say in the governance of CPS. I don’t give anybody money that I don’t have some say in how that money is being spent. Q: How much money has Chicago received in cannabis taxes? How has it been allocated?LIGHTFOOT: We get a tiny, tiny bit of cannabis money. It is three percent. That’s a conversation for another day whether or not that’s fair. I just happen to think it’s not. We getthree percent of the revenue for cannabis, and, as you know, the cannabis industry is just exploding. What are we doing with the money? We put it right back into violence interruption and prevention. All of those dollars are going there. Q: One thing that I am sure that is still on your list is the mental health situation. You promised to do something about mental health.LIGHTFOOT: Seventy-seven neighborhoods as of 2022 all have free mental health services.",
  "date": "2023-02-06"
 },
 {
  "candidate_id": "cand_bj",
  "name_tokens": "Brandon Johnson",
  "announcement_date": "27-Oct-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/brandon-johnson-envisions-higher-heights-for-black-chicago/",
  "title": "Brandon Johnson Envisions Higher Heights For Black Chicago",
  "text": "Johnson is one of eight challengers vying to unseat incumbent mayor Lori Lightfoot. The Defender recently participated in a round-table conversation with former Chicago Public Schools CEO and mayoral candidate Paul Villas. Election Day 2023 in Chicago is Tuesday, Feb. 28.The Defender joined journalists from The Chicago Crusader, N’DIGO, among others for the sit-down conversation held at the Chicago News Weekly office located at 8348 S. Stony Island Ave. in the city’s Avalon Park neighborhood.Johnson discussed his vision for Chicago Public Schools, his budget for Black Chicago, how he would address missing Black women and girls, environmental justice and urban farming, Chicago police, among other topics. (Interview questions and responses have been condensed for clarity and length.) Q: How do you understand food as playing a role in environmental justice? If elected as mayor, how would you incorporate food justice into your environmental plan? Could you elaborate on the Green New Deal and what it looks like for Chicago?JOHNSON: I’m going to support what is going to be a cumulative study so that we have a full understanding of the environmental needs for the city of Chicago. I am confident we can do that within the first 100 days. I’m not going to be the type of mayor that dictates. That’s not my style. I believe in co-governance.As far as co-ops, urban farms and gardens, I think it plays an incredible part in creating healthy, safe communities. There are a couple of examples on the southeast side of Chicago, on the West Side of Chicago, where entire neighborhoods are being supported and sustained.Talking about the Green New Deal, there are opportunities in which we can build a green economy, restore people in terms of their economic development, while also creating a safer environment for people to breathe and drink water. Q: What is your posture on a fully elected school board versus an appointed school board?JOHNSON: The office of the mayor will not be our parents’ or our grandparents’ office. It won’t. Because we’re going to have an elected representative school board. The mayor isn’t going to have absolute control over public school anymore. I fully support a fully elected school board. Q: If elected, what are your three wishlist items? And, if you’re one of the eight that’s not elected, what then?JOHNSON: The first thing I’m going to initiate is the most robust youth hiring program. It’s going to be a year round with a direct correlation between youth employment and violence reduction. I’m going to every single space where our people live and say ‘send me names’. All of the agencies and entities the fifth floor have jurisdiction over we are going to hire.Second thing is there’s a ordinance right now that’s been blocked by the mayor called treatment not trauma. What it would do, it would provide 24-hour access to mental health professionals to respond to the calls that are otherwise diverted to law enforcement.And the third thing is we’re going to reopen the mental health centers. Here’s the key: it needs to be publicly funded. So, when my term is up, it does not matter who the next mayor is, you can’t shut them down because you have a different sort of ideological presentation on what type of health care services should be provided in our communityI wish it wasn’t a wish list. Why are we making this so difficult? Why do we refuse to see young people?I’m going to keep advocating for people, to keep pushing to support you to make sure that our people are seen. That work doesn’t end on February 28. Q: Is it correct that I read that you want to do an income tax of three percent on those getting $100,000 or more?JOHNSON: That was an error and the outlet that reported it in error has corrected it. I do know that sometimes mistakes happen. They corrected it. They got it wrong. For clarity, too, I’m the only person in this race that has released a budget plan. People can talk about all their plans, but if they don’t put on the table how they plan on supporting it, paying for it, then that’s irresponsible. And by the way, I don’t raise property taxes in my budget plan.  Q: Can you share your thoughts about restorative justice and addressing recidivism?JOHNSON: So the one of the first things that I did on the county board was to eliminate the game. Here’s why that’s important. And we need to eliminate the gang database in the city of Chicago as well. It is a wicked structure. No one knows what the criteria is to get on that database. There is no structure in place that if something happens in error, like what happens in all of our industries, how to have someone’s name removed. They had a person on their youngest six or eight and then someone on the list was 104 years old. Like the oldest G in the history of the world. The first law that I passed as a lead sponsor was the just housing ordinance. It eliminated discrimination against those who are seeking housing or formerly incarcerated. Now, you can only go back three years from their arrest. Q: To follow up, does that also include in the courts as well when people are sentenced? Does that include restorative justice as well?JOHNSON: It has to. I want to make sure that we do everything in our power to prevent [incarceration]. I want to make sure I am clear about that because Cook County Jail is a homeless shelter. The sheriff talks about it being a mental health center, it’s a homeless shelter. I hate how they treat our people. I do. People talk about how much they love Chicago. How about loving people? Q: So, is there a plan in your administration to deal with human trafficking and kidnapping of Black women out of this very city?JOHNSON: When we mentioned the school closure there are over 1,000 children who are still missing from the school. When we talk about Black children who are lost or worse, unseen, I get it. It breaks my heart that we don’t have a never forget hashtag. I need help with this. The disappearance of our people and our children starts before they are kidnapped. Q: What would you do about crime?This ain’t just about being tough, y’all. It’s about being smart. And if we’re smarter about how we deploy law enforcement, we alleviate pressure on the front line by getting the folks who are on desk duty to provide more support and then alleviating law enforcement from these day-to day-interactions that don’t keep our community safer, right? Q: Who would you appoint to run Chicago Public Schools, City Colleges, and the Chicago Police Department?JOHNSON: I believe you have to be caring, collaborative, and competent. I can’t tell you who. That would be premature.",
  "date": "2023-01-29"
 },
 {
  "candidate_id": "cand_sk",
  "name_tokens": "Sophia King",
  "announcement_date": "10-Aug-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/alderwoman-sophia-king-announces-mayoral-run/",
  "title": "Alderwoman Sophia King Announces Mayoral Run",
  "text": "The announcement video opens with King walking past 43rd St. and S. Berkeley, where a shooting took place only a few days after she was sworn in as 4th Ward Alderman more than six years ago.“Violence is not an abstract problem to me. I have seen the pain it causes way too many times. There’s no question about it. We have to hold the people who commit violent crimes accountable, and we have to hold our leaders accountable too,” said King.The video also features former Chicago Police Department 2nd District Commander Crystal King-Smith, who worked side-by-side with King.“She always advocated for me as the district commander to get more recruits, and she wants officers who are doing wrong to be held accountable,” said former Commander King-Smith, who is no relation.King’s announcement video also features retired educator and Hyde Park resident Bill Gerstein, who said of Sophia King, “All her life, whenever Sophia sees a problem, she runs towards them to get things done.”Former WFLD Chicago news anchor Robin Robinson added, “She’s a leader on protecting our rights, whether that be reproductive rights or a right to a good job. She fights for the rights of everybody.”As the alderperson representing parts of Downtown, the South Loop, Bronzeville (Douglas, North Kenwood, Oakland, Grand Blvd.), Kenwood, and Hyde Park, King has worked on the front lines on crime and public safety issues, and she’s leading the redevelopment of the long-shuttered Michael Reese Hospital site.While other mega-developments elsewhere in the city drew large-scale protests from residents because the deals were too generous to developers and offered too little affordable housing, Ald. King brought together all parts of the community to ensure more affordable housing, a real community benefits agreement, and higher minority contractor participation.The video also touts King’s leadership on reforming minority contracting as a way to build generational wealth in Black and Brown communities and provide good-paying jobs that can help break the cycle of violence. While goals for citywide minority contractors aim for 25% of planned developments, the number exceeds 40% on projects that King has worked on in her ward.“It’s why we’ve made sure that minority contractors don’t get shut out of city contracts and partner with the community to tackle the root causes of violent crime,” said King.Every community meeting she attends, every day she works with her two police commanders, every shooting incident — Sophia sees firsthand that we can’t keep doing what we’re doing as murders, shootings, and carjackings continue to plague our city.Before entering public service, Sophia King actively connected residents in her community to address some of the largest problems in the city. Whether fighting for youth programs as president of the Kenwood Park Advisory Council, advocating for women’s reproductive rights as vice president of Planned Parenthood Chicago, creating a community response to gun violence with The It’s Time Organization (TITO) in the wake of Hadiya Pendleton’s murder, or advocating for more inclusion in city and state contracts through Harriet’s Daughters, Sophia has skillfully brought people together and engaged them in productive dialog to address complex challenges.“Everything I’ve ever done has been achieved by bringing people together to find real solutions to the problems confronting Chicago. We are big enough and tough enough to tackle our most challenging problems in every neighborhood. But the only way we can do this is if we do this together. All of us. And each of us. Join me,” concluded King.",
  "date": "2022-08-10"
 },
 {
  "candidate_id": "cand_sk",
  "name_tokens": "Ald. King",
  "announcement_date": "10-Aug-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/alderwoman-sophia-king-announces-mayoral-run/",
  "title": "Alderwoman Sophia King Announces Mayoral Run",
  "text": "The announcement video opens with King walking past 43rd St. and S. Berkeley, where a shooting took place only a few days after she was sworn in as 4th Ward Alderman more than six years ago.“Violence is not an abstract problem to me. I have seen the pain it causes way too many times. There’s no question about it. We have to hold the people who commit violent crimes accountable, and we have to hold our leaders accountable too,” said King.The video also features former Chicago Police Department 2nd District Commander Crystal King-Smith, who worked side-by-side with King.“She always advocated for me as the district commander to get more recruits, and she wants officers who are doing wrong to be held accountable,” said former Commander King-Smith, who is no relation.King’s announcement video also features retired educator and Hyde Park resident Bill Gerstein, who said of Sophia King, “All her life, whenever Sophia sees a problem, she runs towards them to get things done.”Former WFLD Chicago news anchor Robin Robinson added, “She’s a leader on protecting our rights, whether that be reproductive rights or a right to a good job. She fights for the rights of everybody.”As the alderperson representing parts of Downtown, the South Loop, Bronzeville (Douglas, North Kenwood, Oakland, Grand Blvd.), Kenwood, and Hyde Park, King has worked on the front lines on crime and public safety issues, and she’s leading the redevelopment of the long-shuttered Michael Reese Hospital site.While other mega-developments elsewhere in the city drew large-scale protests from residents because the deals were too generous to developers and offered too little affordable housing, Ald. King brought together all parts of the community to ensure more affordable housing, a real community benefits agreement, and higher minority contractor participation.The video also touts King’s leadership on reforming minority contracting as a way to build generational wealth in Black and Brown communities and provide good-paying jobs that can help break the cycle of violence. While goals for citywide minority contractors aim for 25% of planned developments, the number exceeds 40% on projects that King has worked on in her ward.“It’s why we’ve made sure that minority contractors don’t get shut out of city contracts and partner with the community to tackle the root causes of violent crime,” said King.Every community meeting she attends, every day she works with her two police commanders, every shooting incident — Sophia sees firsthand that we can’t keep doing what we’re doing as murders, shootings, and carjackings continue to plague our city.Before entering public service, Sophia King actively connected residents in her community to address some of the largest problems in the city. Whether fighting for youth programs as president of the Kenwood Park Advisory Council, advocating for women’s reproductive rights as vice president of Planned Parenthood Chicago, creating a community response to gun violence with The It’s Time Organization (TITO) in the wake of Hadiya Pendleton’s murder, or advocating for more inclusion in city and state contracts through Harriet’s Daughters, Sophia has skillfully brought people together and engaged them in productive dialog to address complex challenges.“Everything I’ve ever done has been achieved by bringing people together to find real solutions to the problems confronting Chicago. We are big enough and tough enough to tackle our most challenging problems in every neighborhood. But the only way we can do this is if we do this together. All of us. And each of us. Join me,” concluded King.",
  "date": "2022-08-10"
 },
 {
  "candidate_id": "cand_pv",
  "name_tokens": "Paul Vallas",
  "announcement_date": "1-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/international-union-of-elevator-constructors-local-2-endorses-paul-vallas-for-mayor/",
  "title": "International Union of Elevator Constructors Local 2 Endorses Paul Vallas for Mayor",
  "text": "CHICAGO, IL — Paul Vallas is continuing to build momentum in the campaign for Mayor, today announcing the endorsement of the International Union of Elevator Constructors Local 2 labor union. Vallas has consistently been among the top candidates in recent publicly available polling and is outspending all other mayoral challengers in television advertising.“The hardworking men and women of I.U.E.C. Local 2 and other blue collar workers are the backbone of our city’s middle class, and they deserve a Mayor who will stand up for them by making Chicago a safer place for everyone who lives and works here,” said Vallas. “I’m proud to receive this endorsement today and to continue building on our campaign’s momentum as we work to reach more voters with our message of putting crime and public safety first.”“I.U.E.C Local 2 is proud to endorse Paul Vallas for Mayor,” said I.U.E.C. Local 2 President & Business Manager Juan Gonzalez, Jr. “The men and women of Elevator Constructors Local 2 know that Paul Vallas was a strong proponent of the Worker’s Rights Amendment and, as Chicago’s next Mayor, will support the health and welfare of Local 2’s membership as well as advocate on behalf of all the hard working families in Chicago’s strong Labor workforce.”",
  "date": "2023-01-25"
 },
 {
  "candidate_id": "cand_pv",
  "name_tokens": "Paul Vallas",
  "announcement_date": "1-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-makes-case-for-second-term/",
  "title": "Mayor Lightfoot Makes Case For Second Term",
  "text": "Lightfoot is facing stiff competition with eight challengers – including six Black candidates – looking to unseat her after one full term in office on Election Day 2023 in Chicago on Tuesday, Feb. 28.“Why me as opposed to anyone else who is running? I’ll tell you why. Number one there’s no other Black candidate that has a shot of even getting into the runoff and is never going to see the inside of City Hall other than being invited as a guest,” said Lightfoot in her opening remarks. “That’s the truth. You can look at the polls, you can slice the numbers 20 ways from Sunday, but fundamentally any vote coming out of Black Chicago that’s not for Lori Lightfoot is giving it to [Paul] Villas or Chuy [Garcia].”The Defender joined journalists from The Chicago Crusader, N’DIGO, among other publications for a 90-minute sit-down conversation with the mayor held at the Chicago News Weekly office located at 8348 S. Stony Island Ave. in the city’s Avalon Park neighborhood. During the interview, Lightfoot addressed criticism levied against her by her political opponents, defended her record of accomplishments as mayor, discussed elements from her most recently passed budget, and more.The Defender recently participated in round-table interviews with mayoral candidate Cook County Commissioner Brandon Johnson and former Chicago Public Schools CEO and mayoral candidate Paul Vallas. (Interview questions and responses have been condensed for clarity and length.) Q: Do you support reparations for Black Chicago? If not, what does that look like?LIGHTFOOT: Reparations is called INVEST SOUTH/WEST. Reparations is called the procurement reforms that we’ve done to make sure that larger chunks of the city’s 3.5 billion dollars are going into Black and brown Chicago. Reparations is called the $31 million that we put into mostly Black Chicago through our targeted financial assistance, meaning $500 a month for 5,000 families for a year and helping them overcome the financial challenges that they have to make sure that when that pilot program is over, they’re in a better position than where they were before. Everything that I am doing is focused on equity and inclusion. Some people want to call it reparation. That’s fine. I call it building Black wealth. Q: What’s the plan moving forward for environmental issues in Chicago?LIGHTFOOT: Let me start with how much money that we’ve invested in all things environmental, specifically focused on environmental justice, 188 million dollars, the largest investment in environmental policy in concrete things in the history of the city. But let me step back. When I came into office, it wasn’t just that the prior administration disbanded theDepartment of Environment, we had stepped back from any leadership role, any environmental justice, environmental integrity, climate action, you name it. We were nowhere as a city… The other thing that we have done is make sure that we’re preserving Lake Michigan. It was very difficult to get done through the Trump Administration, but we finally got it done with the help of Senator Dick Durbin, which is to get the Army Corps of engineering to get the money to get for a study that is critical to doing the revetment work to stop the flooding that’s happening in areas of our city on the Far North Side, but also on the Far South Side that didn’t have that revetment for 20 some years. For example, every time there’s a storm on Lake Michigan, you can see the flooding three blocks in from the lake. Basements of buildings being flooded, cars being flooded, streets being flooded. We finally were able to get the work of revetment started. Q: You received $29 million from Congressman Danny Davis for health care training. We were talking about health care disparities. Have you had a chance to reflect on that and put minorities into the pipeline?LIGHTFOOT: So, a couple of things that we did along that line. I mentioned there were some silver linings, even in the very dark cloud of COVID. We knew that we needed to build up a community healthcare corps because I can come and knock on your door and you’re not going to answer. But if you’ve got a neighbor that you know and you trust, you’re going to open up that door. Not only are you going to open up that door, you’re going to have a conversation. And one of the biggest challenges that we faced during the first two years of COVID was getting people educated about the disease. We had to do a lot of myth busting. You may remember that a lot of Black folks said Black people can’t get COVID. The truth is the first person who died in our city was a middle-aged Black woman. We had to do a lot of work, but what we learned was we have to have troops on the ground who are trusted in the community to be able to get the message out, to be able to knock down people’s mess myths about the healthcare system and get them to be proactive about taking care of themselves. We couldn’t do that from the top down, we needed to do that at the block level. So, we hired 600 community health care workers in 2020 and mostly what they were doing initially was helping us reach out to educate, communicate, and the vast majority of them are Black and brown. I think an overwhelming number are Black. The idea wasn’t to just have 600 people that the city paid, but to get them real careers in health care and be that community healthcare force that we knew we were going to need on a going forward basis for public health. So, I think that that has been a tremendous success, but it’s given us insights that’s invaluable for us to know how we do service delivery. How do we reach people? How do we connect them up to services? We borrowed that model, if you will, from West Side United. Q: Do you support an elected school board?LIGHTFOOT: I do support an elected school board. I do not support the legislation that was passed. And I’m happy to spend another succession going chapter and verse on that, not in the least of which is they don’t account for that symbiotic financial relationship between the city and Chicago Public Schools (CPS). No one’s going to continue to pay what is in excess of half a billion dollars every year to CPS if they don’t have any say in the governance of CPS. I don’t give anybody money that I don’t have some say in how that money is being spent. Q: How much money has Chicago received in cannabis taxes? How has it been allocated?LIGHTFOOT: We get a tiny, tiny bit of cannabis money. It is three percent. That’s a conversation for another day whether or not that’s fair. I just happen to think it’s not. We getthree percent of the revenue for cannabis, and, as you know, the cannabis industry is just exploding. What are we doing with the money? We put it right back into violence interruption and prevention. All of those dollars are going there. Q: One thing that I am sure that is still on your list is the mental health situation. You promised to do something about mental health.LIGHTFOOT: Seventy-seven neighborhoods as of 2022 all have free mental health services.",
  "date": "2023-02-06"
 },
 {
  "candidate_id": "cand_pv",
  "name_tokens": "Paul Vallas",
  "announcement_date": "1-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/alderman-brian-hopkins-endorses-vallas-for-mayor/",
  "title": "Alderman Brian Hopkins Endorses Vallas for Mayor",
  "text": "CHICAGO, IL — Mayoral candidate Paul Vallas picked up another major endorsement today, with Alderman Brian Hopkins announcing his support for the surging Vallas campaign. Alderman Hopkins has represented the 2nd Ward since 2015 and has been a consistent voice for good government, accountability and protecting Chicago taxpayers from increased cost of living.“I know that Paul Vallas is the best candidate in this race to bring honesty and accountability to City Hall and to ensure that we are investing in the right programs and initiatives to improve quality of life,” said Alderman Hopkins. “Paul’s extensive plans on critical issues like public safety, education and economic development are exactly what Chicago needs, and I’m proud to endorse his campaign today.”Vallas has been surging in the polls in recent weeks and picked up a major endorsement just days ago, when Alderman Tom Tunney announced his support. He was also endorsed this morning by the Chicago Tribune Editorial Board.“I’m incredibly proud to earn Alderman Hopkins’ endorsement and I look forward to working with him to make our city more affordable for residents and invest in critical priorities facing our community,” said Vallas. “Our campaign is gaining more momentum every day as more and more Chicagoans see that there’s only one candidate who will put crime reduction and public safety first, and we will continue to push hard through the finish line.”",
  "date": "2023-02-03"
 },
 {
  "candidate_id": "cand_pv",
  "name_tokens": "Paul Vallas",
  "announcement_date": "1-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/chicago-tribune-endorses-vallas-for-mayor/",
  "title": "CHICAGO TRIBUNE ENDORSES VALLAS FOR MAYOR",
  "text": "CHICAGO, IL — The Chicago Tribune Editorial Board announced its endorsement of Paul Vallas for Mayor this morning. The endorsement from the Tribune caps an eventful week for the Vallas campaign that also included notable endorsements from leading elected officials and continued forward momentum in the polls.In the endorsement, the Tribune wrote of Vallas:“Demonstrably, Chicago is a city in need of a turnaround, and, in Paul Vallas, we’re endorsing a smart, passionate and experienced candidate for mayor who long has specialized in doing precisely that.Unapologetically wonkish, the Chicago-born Vallas, who was CEO of Chicago Public Schools from 1995 to 2001 and of the School District of Philadelphia from 2002 to 2007, has successfully positioned himself as the candidate with detailed plans and fresh ideas, and has nationally recognized expertise in city financing, policing and public education, the three components of city life most in dire need of attention.”“Winning the endorsement of the Chicago Tribune is the latest proof that our campaign is picking up major momentum as we get closer to Election Day,” said Vallas. “I’ve always been a problem solver throughout my career in public service, and it’s clear to me that with the right leadership our city can thrive once again as the best place in the country to live, work, raise a family, open a business or serve the community. I want to be a Mayor for all of Chicago by uniting us behind our common goals of making our city safer, providing a better public education for our kids and helping every neighborhood reach its full potential, and today we are one step closer to those goals.”",
  "date": "2023-02-03"
 },
 {
  "candidate_id": "cand_pv",
  "name_tokens": "Paul Vallas",
  "announcement_date": "1-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/paul-vallas-meets-chicagos-legacy-black-press/",
  "title": "Paul Vallas Meets Chicago’s Legacy Black Press",
  "text": "The Defender was joined by journalists from The Chicago Crusader, North Lawndale Community News, N’DIGO, among others for the sit-down conversation held at the Chicago News Weekly office located at 8348 S. Stony Island Ave. in the city’s Avalon Park neighborhood.During the roundtable, Vallas responded to questions primarily concerning the Chicago Police Department’s budget and hiring of new officers, public safety, his business agenda for Black-owned businesses, and more. (Interview questions and responses have been condensed for clarity and length.) Q: You said you always answered the call for help, who called you in for help on this one? VALLAS: Really, since the last election, I supported Lori and I tried to help her particularly when the teachers union struck. I tried to give her advice when COVID was approaching and it was clear the city needed to prepare financially. As I began to post and as I began to do op-ed pieces a number of people asked me to consider running again. I could put out some dramatic names, but I don’t want to put any aldermen in a tight spot. Q: I believe community police should come from people in that community. Can you respond to that? Would you look at that? VALLAS: There is no substitute for beat integrity and that includes cops covering local beats. There were 406,000 911 calls that were not responded to last year. Thirty-two thousand were high priority calls. You got to return to community based policing where you know the cops and their badge numbers. You need to establish that kind of personal relationship. What I propose in terms of expanding the ranks and diversifying the community is something I actually proposed four years ago. And we just use the ROTC programs and military academy programs, which I proposed. Those students are among the higher performing students, all the military academies, all seven of them in Chicago, never been on the watch list. Eighty-six percent of the kids are Black and Latino. Forty-six percent of the kids are young women. The bottom line is: you could create a pipeline so that the next generation of police officers and first responders and EMTsand maybe bionics and and the next generation of nurses could actually come from those programs themselves. Q: If you were elected, would you retain the current [Chicago Police Superintendent David Brown]? VALLAS: Absolutely not. There are officers you all know that could step into the superintendent’s rank.  Q: Do you see the current superintendent as part of the problem? VALLAS: Yeah, I do.Q: I was curious to know your thoughts on defunding policing and using city funds for things in terms of housing, and other things that don’t involve policing whatsoever. Do you have any response to that? VALLAS: I’ll respond by saying the mayor controls 20 billion dollars in spending. She controls the city, park district, schools, airports, etc. I just want to put it into perspective that when they say ‘oh, we’re spending forty percent of the fund on policing’ that’s a corporate fund, that’s a limited fund of the budget. So the point is, I don’t think you need to increase police funding. I think you need to fill the vacancies and if you fill the vacancies, the money you’ll save on overtime will probably costs. So you know, so I don’t think we need to put more money [in policing]. We need to allocate that money effectively.  Q: Would you decrease the amount that is currently being spent on policing and allocate that money into other spaces? VALLAS: No, I wouldn’t decrease it. Q: INVEST South/West: would you put more money into it?(Note: According to the City of Chicago: “INVEST South/West is an unprecedented community improvement initiative by the City of Chicago that is strategically reversing decades of systemic public and private disinvestment within the city’s West and South Side neighborhoods.”) VALLAS: First, I have no problem with INVEST South/West. INVEST South/West is two-thirds [former Chicago Mayor] Rahm Emanuel. What I am talking about is INVEST South/West on steroids. Three things: by having an entity independent of politics focusing exclusively on making an investment. Secondly, I’m talking about providing a permanent form of revenue – this is the community investment fund – every year whether it be casino money, or gaming, or video poker money which I would like to legalize and put in that fund, or put millions of dollars in TIFsurplus that the city could put in that fund so there could be a steady flow of capital that could be used to invest in a whole variety of things, social services, small businesses. The third thing would be land banking. We take this vacant property, idle property, and you activate it, and you turn it over to local community developers. Q: Do you plan to reopen those six mental health clinics that Rahm Emanuel closed and Lori Lightfoot failed to reopen? VALLAS: Yeah, well, what I said four years ago and I’d say today is every police district needs to have a mental health center. So at the end of the day, Rahm Emanuel made a lot of decisions that he claimed he needed to make to save money and he really didn’t. Mental health centers will pay for themselves if you’re billing properly Medicaid, Medicare insurance companies. There’s no reason why you can’t open a community based community operated and run mental health centers in each of the police districts. Q: Would you prefer the mental health clinics be inside the police offices? VALLAS: No, no, no. In the districts, not [inside] the [police] buildings. Q: You mentioned on your website that you would bypass Cook County’s State’s Attorney Kim Foxx if you needed to. Could you elaborate on what you meant? VALLAS: This is what I said on the website. I said, number one, you need to bring everybody together, you need to work with everybody. Number two is you need to be prepared and have the capacity to bypass if you think individuals are not being charged should be charged right now. Meaning you have to have a relationship with the US Attorney’s Office, and you have to have and you have to have the capacity to go directly to the judges themselves. There’s a lot of hate crimes, and there’s a lot of crimes like witnesses being threatened and intimidated. And individuals are not being charged. Q: So, are you directing any of these comments directly to Kim Foxx herself? VALLAS: Whoever the state’s attorney is, whether it’s Kim Foxx or what’s somebody who replaces Kim Foxx, that’s what I’m referring to.",
  "date": "2023-01-19"
 },
 {
  "candidate_id": "cand_pv",
  "name_tokens": "Paul Vallas",
  "announcement_date": "1-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/paul-vallas-raises-over-1-million-during-4th-quarter-fundraising-period/",
  "title": "Paul Vallas Raises Over $1 Million During 4th Quarter Fundraising Period",
  "text": "“Residents across Chicago are sending a clear message that they are tired of failed leadership and want to elect a Mayor who puts crime and their safety first,” said Vallas. “The people of our city know that I will work tirelessly for a safer, better Chicago and the financial support we are receiving is proof of that.” The substantial fundraising numbers announced by the Vallas campaign provide the resources needed to continue engaging with voters on TV, in person, and through digital media. Paul’s executive experience and focus on critical issues facing the voters of Chicago are reflected in his strong fundraising efforts.",
  "date": "2023-01-18"
 },
 {
  "candidate_id": "cand_ww",
  "name_tokens": "Willie Wilson",
  "announcement_date": "11-Apr-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/businessman-willie-wilson-enters-2023-race-for-chicago-mayor/",
  "title": "Businessman Willie Wilson Enters 2023 Race for Chicago Mayor",
  "text": "For the 2023 race, Wilson said in a statement that he will donate his mayor’s salary of $216,210 to churches and non-profits. Wilson recently headed two multimillion-dollar gas giveaways, which he is promising to do again.Current Chicago mayor Lori Lightfoot hasn’t officially announced her run for reelection, but it’s expected that she’ll go for a second term, WGN-TV reports.Wilson previously endorsed Mayor Lightfoot for her first term but has now stated that was a mistake, according to the Chicago Sun-Times.“You [Mayor Lightfoot] should not shut down churches because of COVID and not shut down the marijuana places. Our religion is sacred. Stay away from our religion,” Wilson said. “The lady had the nerve to come into churches and tell them to close down and give them tickets [if they refused]. I resent that.”Wilson’s run could hurt Mayor Lightfoot’s reelection chances by cutting into her support with older black women.Political operative Victor Reyes said to Chicago Sun-Times, “Her strongest base of support is older African-American women. That’s where he would potentially cut in — with the church folks he appeals to. Reyes added, “It does significantly hurt her in the context that he might appeal to that older Black base that seems to be sticking with her.”Wilson said in a statement about his candidacy, “I don’t need to run for mayor to get a paycheck. My wanting to do this is to serve the community. We want to bring all race, creed, and color together.”Get the latest news 24/7 on The Black Information Network. Listen now on the iHeartRadio app or click HERE to tune in live.Black Information Network is the first and only 24/7 national and local all-news audio service dedicated to providing an objective, accurate and trusted source of continual news coverage with a Black voice and perspective. BIN is enabled by the resources, assets and financial support of iHeartMedia and the support of its Founding Partners: Bank of America, CVS Health, GEICO, Lowe’s, McDonald’s USA, Sony, 23andMe and Verizon. BIN is focused on service to the Black community and providing an information window for those outside the community to help foster communication, accountability and deeper understanding.Black Information Network is distributed nationally through the iHeartRadio app and accessible via mobile, smart speakers, smart TVs and other connected platforms, and on dedicated all-news local broadcast AM/FM radio stations. BIN also provides the news service for iHeartMedia’s 106 Hip Hop, R&B and Gospel stations across the country. Please visit www.BINNews.com for more information.",
  "date": "2022-04-12"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-announces-twelve-recipients-of-27-million-in-community-development-grants/",
  "title": "MAYOR LIGHTFOOT ANNOUNCES TWELVE RECIPIENTS OF $27 MILLION IN COMMUNITY DEVELOPMENT GRANTS",
  "text": "CHICAGO—Mayor Lori E. Lightfoot announced today that twelve neighborhood businesses and nonprofit organizations are set to receive more than $27 million in Community Development Grants. Ranging from approximately $54,000 to $5 million, the grants will support neighborhood investments for local cooperative grocery stores, health centers, music education centers, and locally owned restaurants. Grants will be used to fund interior renovations, new construction, and other eligible costs. \n“I’m thrilled to announce this year’s first round of community development grant awards that will ensure our city’s economic recovery while revitalizing our neighborhoods,” said Mayor Lightfoot. “The recipients of these awards will bring much-needed grocery stores, office and retail spaces, and community hubs to neighborhoods across Chicago, expanding our residents’ access to nutritious food, healthcare, education, and job opportunities.”\nThe Community Development Grant program is part of Mayor Lightfoot’s Chicago Recovery Plan, the City’s $1.2B new investment strategy to enable Chicago’s economic recovery post-Covid. The program has committed more than $150M toward more than 170 projects across the city since the beginning of 2022 and leverages additional funding sources to better support catalytic growth. The grants are designed to support neighborhood vitality, economic development, community wealth building, public health, and local planning goals. \nFunding sources include City of Chicago bond funds and proceeds from the Department of Planning and Development’s (DPD) Tax Increment Financing program.\n“These grants are being strategically allocated through a competitive application process that considered multiple criteria, including community needs, project viability, team diversity, and other factors,” DPD Commissioner Maurice Cox said. “The selection process and the City’s ongoing technical assistance will collectively ensure these investments have a maximum impact at the neighborhood level.”\nRecipients and grant amounts include the following: \nProject Name  Community   Area (Ward)  Description  Funding Amount  BandWith  East Garfield Park (27)  Adaptive reuse of an existing industrial building for a community performing arts center and youth music education non-profit organization. $5.0M  Demera Ethiopian Restaurant  Grand Boulevard (4)  Adaptive reuse of an existing building for a ground floor restaurant with rooftop dining space, second floor office space, and second- and third floor residential units.  $3.1M  Revive 360  Woodlawn (20)  Redevelopment of the Washington Park National Bank Building for Class A office and retail space, including co-working space and a food hall, and complete renovation of the historic façade.  $5.0M  Yellow Banana – Altgeld  Riverdale (9)  New construction of 10,000 SF grocery store. $4.87M  Sunshine’s Place  North Lawndale (28)  Build out of a new restaurant in a currently vacant building in an INVEST South/West and Community Safety focus neighborhood. $54,375  Circle Foundation  Bridgeport (11)  Build-out of a new student-run café in an existing community center. $154,875  Southside Market  Chatham (6)  Buildout of a micro-grocery co-operative. $239,826  Kilwins  Hyde Park (4)  Expansion of an existing chocolate and ice cream shop to include private outdoor patio space. $250,000  88 Plates LLC  Uptown (48)  Buildout of new Asian restaurant/café in recently vacated restaurant space.   $156,750  La Catrina LLC  East Side (10)  Renovation of vacant property to create a new small banquet hall and event space.$250,000  Tapestry 360 Health  Uptown (46)  A new community health center to replace the current location, which will provide primary care, behavioral health, and dental services with expanded healthcare offerings and increased patient capacity.  $3.8M  IMAN Health Center Chicago Lawn (16)  20,053 sf expansion to provide critical holistic healthcare services and further stabilize the 63rd/California intersection.  $5M      TOTAL  $27.9M  \nApplications for City financial assistance are currently being accepted by the DPD. Opportunities for funding include projects focused on business expansion, community development, community wealth-building, equitable transit-oriented development, and climate infrastructure improvements. The next application due date is Friday, Feb. 24th, 2023.    \nTo apply or for more information, see the Chicago Recovery Plan web site. \n                ",
  "date": "2023-02-11"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-and-the-chicago-department-of-public-health-announce-the-expansion-of-citywide-mental-health-network-to-all-77-neighborhoods/",
  "title": "MAYOR LIGHTFOOT AND THE CHICAGO DEPARTMENT OF PUBLIC HEALTH ANNOUNCE THE EXPANSION OF CITYWIDE MENTAL HEALTH NETWORK TO ALL 77 NEIGHBORHOODS",
  "text": "CHICAGO — Mayor Lori E. Lightfoot and the Chicago Department of Public Health (CDPH) announced today that the City of Chicago has successfully expanded access to publicly funded mental health services for residents in all 77 neighborhoods throughout the city. The City has continued to grow this network throughout the pandemic and is now funding no-barrier access to mental health services at a total of 177 clinics and clinical programs across all 77 Chicago community areas — along with primary and behavioral health care at 80 shelters for people experiencing homelessness.  \nCollectively known as Chicago’s Trauma-Informed Centers of Care (TICC) network, the mental health providers in the network all receive city funding to complement their federal, state, county, and philanthropic funding — and all must provide no-barrier mental health services. Partners include Community Mental Health Centers, Federally Qualified Health Centers, and Community-Based Organizations, along with CDPH’s five directly-operated mental health clinics and new planned extension clinics in partnership with the Chicago Public Library and O’Hare Airport. \n“When I took office, the City was delivering mental health services to 3,600 adults per year and zero children in only 11 of Chicago’s 77 neighborhoods,” said Chicago Mayor Lori E. Lightfoot. “Now, we are delivering these critical services to tens of thousands of adults and children across each of our communities. This tremendous accomplishment was made possible by CDPH and the many community partners, who share my goal of creating a truly accessible mental healthcare system that serves all of our residents right in their own neighborhoods.”  \nThe Trauma-Informed Centers of Care network provides a range of high-quality mental health services to adults, children, and families regardless of health insurance, immigration status, or ability to pay. In addition to growing the TICC network, CDPH has doubled the size of its own mental health staff from approximately 50 in 2019 to 100 staff today.   \n“We need clinics, of course — but we also need to bring mental health services into the community to reach people who may never visit a stand-alone mental health site,” said CDPH Commissioner Allison Arwady, M.D. “With twice as many positions on the CDPH mental health team, we are now embedding mental health crisis clinicians in the 911 system through the CARE program; reaching people experiencing homelessness by funding care in shelters and outreach on the CTA; and building home-based mental health care for the highest-need Chicagoans. At the same time, we invested in the development and coordination of the TICC network. Now that we have high-quality services in every one of our 77 neighborhoods, we can more seamlessly and quickly connect Chicagoans to mental health care, regardless of their circumstances or their address. We’re not done yet, but together with our partners, we are building the mental health system that Chicago has long needed.”  \nSince 2019, Mayor Lightfoot and the City Council have increased the budget for mental health services more than seven-fold, from $12M in 2019 to $89M in 2023. As a result, more than 73,000 Chicagoans received City-funded mental health services in 2022, compared to 3,651 people in 2019. Where zero children were served in 2019, the TICC community network provided vital support and services to 13,666 children in 2022. Each TICC provider uses City funding to either establish new or augment existing mental health services.  “We are proud to be a part of this partnership that helps us further our own mission of fostering health, wellness, and healing through a holistic and comprehensive system of community-based behavioral health for all Chicagoans,” said Dr. Rami Nashashibi, Executive Director of the Inner-City Muslim Action Network (IMAN). “With investments from CDPH, we have been able to hire staff and add programs to increase much-needed access to care for residents right here in Chicago Lawn, West Englewood, and across the South Side.” \nAs part of the expansion into all 77 Chicago communities, CDPH is building on its partnership with Chicago Public Libraries and establishing CDPH extension clinics at select Chicago Public Library locations — embedding CDPH mental health clinicians to allow residents to receive mental health counseling services at their local library.  CDPH is also planning an extension clinic at O’Hare Airport.  \nTo get connected to mental health services, please visit mentalhealth.chicago.gov, call 211, or call the CDPH Mental Health Clinic Intake Line at 312-747-1020. ",
  "date": "2023-02-11"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-makes-case-for-second-term/",
  "title": "Mayor Lightfoot Makes Case For Second Term",
  "text": "Lightfoot is facing stiff competition with eight challengers – including six Black candidates – looking to unseat her after one full term in office on Election Day 2023 in Chicago on Tuesday, Feb. 28.“Why me as opposed to anyone else who is running? I’ll tell you why. Number one there’s no other Black candidate that has a shot of even getting into the runoff and is never going to see the inside of City Hall other than being invited as a guest,” said Lightfoot in her opening remarks. “That’s the truth. You can look at the polls, you can slice the numbers 20 ways from Sunday, but fundamentally any vote coming out of Black Chicago that’s not for Lori Lightfoot is giving it to [Paul] Villas or Chuy [Garcia].”The Defender joined journalists from The Chicago Crusader, N’DIGO, among other publications for a 90-minute sit-down conversation with the mayor held at the Chicago News Weekly office located at 8348 S. Stony Island Ave. in the city’s Avalon Park neighborhood. During the interview, Lightfoot addressed criticism levied against her by her political opponents, defended her record of accomplishments as mayor, discussed elements from her most recently passed budget, and more.The Defender recently participated in round-table interviews with mayoral candidate Cook County Commissioner Brandon Johnson and former Chicago Public Schools CEO and mayoral candidate Paul Vallas. (Interview questions and responses have been condensed for clarity and length.) Q: Do you support reparations for Black Chicago? If not, what does that look like?LIGHTFOOT: Reparations is called INVEST SOUTH/WEST. Reparations is called the procurement reforms that we’ve done to make sure that larger chunks of the city’s 3.5 billion dollars are going into Black and brown Chicago. Reparations is called the $31 million that we put into mostly Black Chicago through our targeted financial assistance, meaning $500 a month for 5,000 families for a year and helping them overcome the financial challenges that they have to make sure that when that pilot program is over, they’re in a better position than where they were before. Everything that I am doing is focused on equity and inclusion. Some people want to call it reparation. That’s fine. I call it building Black wealth. Q: What’s the plan moving forward for environmental issues in Chicago?LIGHTFOOT: Let me start with how much money that we’ve invested in all things environmental, specifically focused on environmental justice, 188 million dollars, the largest investment in environmental policy in concrete things in the history of the city. But let me step back. When I came into office, it wasn’t just that the prior administration disbanded theDepartment of Environment, we had stepped back from any leadership role, any environmental justice, environmental integrity, climate action, you name it. We were nowhere as a city… The other thing that we have done is make sure that we’re preserving Lake Michigan. It was very difficult to get done through the Trump Administration, but we finally got it done with the help of Senator Dick Durbin, which is to get the Army Corps of engineering to get the money to get for a study that is critical to doing the revetment work to stop the flooding that’s happening in areas of our city on the Far North Side, but also on the Far South Side that didn’t have that revetment for 20 some years. For example, every time there’s a storm on Lake Michigan, you can see the flooding three blocks in from the lake. Basements of buildings being flooded, cars being flooded, streets being flooded. We finally were able to get the work of revetment started. Q: You received $29 million from Congressman Danny Davis for health care training. We were talking about health care disparities. Have you had a chance to reflect on that and put minorities into the pipeline?LIGHTFOOT: So, a couple of things that we did along that line. I mentioned there were some silver linings, even in the very dark cloud of COVID. We knew that we needed to build up a community healthcare corps because I can come and knock on your door and you’re not going to answer. But if you’ve got a neighbor that you know and you trust, you’re going to open up that door. Not only are you going to open up that door, you’re going to have a conversation. And one of the biggest challenges that we faced during the first two years of COVID was getting people educated about the disease. We had to do a lot of myth busting. You may remember that a lot of Black folks said Black people can’t get COVID. The truth is the first person who died in our city was a middle-aged Black woman. We had to do a lot of work, but what we learned was we have to have troops on the ground who are trusted in the community to be able to get the message out, to be able to knock down people’s mess myths about the healthcare system and get them to be proactive about taking care of themselves. We couldn’t do that from the top down, we needed to do that at the block level. So, we hired 600 community health care workers in 2020 and mostly what they were doing initially was helping us reach out to educate, communicate, and the vast majority of them are Black and brown. I think an overwhelming number are Black. The idea wasn’t to just have 600 people that the city paid, but to get them real careers in health care and be that community healthcare force that we knew we were going to need on a going forward basis for public health. So, I think that that has been a tremendous success, but it’s given us insights that’s invaluable for us to know how we do service delivery. How do we reach people? How do we connect them up to services? We borrowed that model, if you will, from West Side United. Q: Do you support an elected school board?LIGHTFOOT: I do support an elected school board. I do not support the legislation that was passed. And I’m happy to spend another succession going chapter and verse on that, not in the least of which is they don’t account for that symbiotic financial relationship between the city and Chicago Public Schools (CPS). No one’s going to continue to pay what is in excess of half a billion dollars every year to CPS if they don’t have any say in the governance of CPS. I don’t give anybody money that I don’t have some say in how that money is being spent. Q: How much money has Chicago received in cannabis taxes? How has it been allocated?LIGHTFOOT: We get a tiny, tiny bit of cannabis money. It is three percent. That’s a conversation for another day whether or not that’s fair. I just happen to think it’s not. We getthree percent of the revenue for cannabis, and, as you know, the cannabis industry is just exploding. What are we doing with the money? We put it right back into violence interruption and prevention. All of those dollars are going there. Q: One thing that I am sure that is still on your list is the mental health situation. You promised to do something about mental health.LIGHTFOOT: Seventy-seven neighborhoods as of 2022 all have free mental health services.",
  "date": "2023-02-06"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-announces-chicago-resiliency-fund-2-0-is-now-accepting-applications-from-domestic-workers-and-undocumented-residents-seeking-financial-relief/",
  "title": "MAYOR LIGHTFOOT ANNOUNCES CHICAGO RESILIENCY FUND 2.0 IS NOW ACCEPTING APPLICATIONS FROM DOMESTIC WORKERS AND UNDOCUMENTED RESIDENTS SEEKING FINANCIAL RELIEF",
  "text": "CHICAGO — Today, Mayor Lori E. Lightfoot and Department of Family and Support Services (DFSS) Commissioner Brandie Knazze announced that domestic workers and undocumented residents are now eligible to apply for the Chicago Resiliency Fund 2.0, which will provide one-time, $500 relief payments to populations that had difficulties accessing and qualifying for federal relief payments during the COVID-19 pandemic. The City plans to award relief payments to up to 7,000 domestic workers and 10,000 undocumented residents.  “Care workers are the backbone of our economy — they make all other work possible. As a daughter of a domestic worker, I know the challenges they face day in and day out to support other families while trying to keep their own afloat,” said Mayor Lightfoot. “This fund represents the continued commitment from my administration to ensure that our hardest-hit residents, including domestic workers and undocumented residents, get access to recovery funds.”  To be eligible, applicants must be a domestic worker or undocumented resident, live in Chicago, be 18 or older, and have household income at or below 300% of the Federal Poverty Level ($69,090 for a household of 3). The Chicago Resiliency Fund 2.0 is open to all eligible Chicago residents, regardless of legal immigration status. No questions will be asked regarding citizenship or immigration status in the application or verification process. COVID-19 cash assistance is not considered under public charge analysis.   Applications must be submitted online at www.chicash.org. The application is currently available in English and Spanish. Chinese (Traditional and Simplified), Arabic, and Polish translations are forthcoming. DFSS has engaged Heartland Human Care Services, YWCA Metropolitan Chicago, and a wide array of community-based organizations to offer information and application assistance events across the city during the application process. Community organizations who want to help engage their communities should visit the website to access outreach materials, sign up to host an event using the Partner Form linked on the website, and to register for one of the upcoming virtual information session on Thursday, February 2, from 12 to 1 p.m. or Saturday, February 4, from 10 to 11 a.m.  \n“While the COVID stimulus payments were a great help for so many during the pandemic, many hard-working residents were left out of this critical resource,” said DFSS Commissioner Brandie Knazze. “The Resiliency Fund 2.0 is designed to help those who had to navigate the pandemic without such resources. We are grateful to our nonprofit partners for their support in helping our residents to access this financial assistance and to promote an equitable recovery from COVID-19.” \n“The YWCA is proud to partner with the City of Chicago on community outreach and application assistance for this historic program, leading a coalition of partners, including ARISE Chicago and others,” said Nicole Robinson, CEO, YWCA Metropolitan Chicago. “As a trusted resource for communities across Chicagoland, we can help elevate visibility of this program and help ensure that those who qualify have the opportunity to successfully apply. As an organization focused on driving economic equity, we’re thrilled to be connecting those in need with financial assistance to help meet the needs of their families.”  The term “domestic worker” refers to those who in the last 12 months have been paid for household services such as childcare or housekeeping which take place in a private home or residence. “Undocumented resident” refers to anyone residing in the United States without immigration status, and who lacks a social security number valid for employment. At this time, DACA recipients and new arrivals on humanitarian parole are not eligible to receive funds.  Applicants will be approved on a rolling basis and will need to submit proof of eligibility. Eligible applicants who were living in the United States in 2020 and 2021 and who have not received any previous COVID-19 cash assistance from the State of Illinois’ Welcoming Center COVID-19 Recovery Fund or from the Immigrant Family Support Project will be given priority for this fund. Up to two applications per household will be accepted.   For more information about eligibility and the application, residents should visit www.chicash.org to review the FAQs, find helpdesk contact information, and find an upcoming information or assistance event in their community.   “As part of Heartland’s mission to secure equity and opportunity for all, we are thrilled to partner with the City to serve as program administrator for the Chicago Resiliency Fund 2.0,” said David Sinski, Executive Director of Heartland Human Care Services. “We believe that the Fund will help those who have been unable to receive traditional cash assistance secure a little more stability in their lives as they continue to recover from the pandemic’s impact.”  The Chicago Resiliency Fund 2.0 is still accepting and processing applications from eligible households who claimed an adult dependent in their 2019 taxes, such as a college student or disabled relative. Spouses are not considered a dependent. For this application, also accessible on www.chicash.org, the tax filer should apply on behalf of the household and be prepared to upload a copy of their 2019 tax return or tax transcript. Residents should take care to navigate to the correct application based on their eligibility category.  \nIn 2020, Mayor Lightfoot launched the Your Home is Someone’s Workplace campaign to bring awareness to the rights of domestic workers and to ensure they are treated with the dignity and respect that they deserve. In 2021, Mayor Lightfoot led efforts to expedite domestic workers to the $15/hour minimum wage by August 2021 and passed key legislation requiring all domestic workers to have a written contract. In 2022 and 2023, the City has funded direct outreach to domestic workers to equip them with information about their rights and to act as peer leaders in their communities.  \nUnder Mayor Lightfoot’s administration, Chicago was ranked number one for socioeconomic integration and pro-immigration policies out of the hundred largest cities in the US. The Office of New Americans works to engage and promote the wellbeing of diverse immigrant and refugee communities throughout the city and supports City departments in ensuring full and equal access to social services. \nThe Chicago Resiliency Fund 2.0 is part of the $1.9B Chicago Recovery Plan bucket of investments and represents a continued commitment from the City of Chicago to center households in the economic recovery from the COVID-19 pandemic. The fund is modeled after the 2020 Chicago Resiliency Fund, which was a public-partner partnership between the City of Chicago, The Resurrection Project and Open Society Foundation that provided cash assistance to residents excluded from the first federal stimulus payments. The first round of Resiliency Fund 2.0 offered cash assistance payments for caretakers of adults who filed taxes in 2019.",
  "date": "2023-02-02"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/statement-from-mayor-lori-e-lightfoot/",
  "title": "STATEMENT FROM MAYOR LORI E. LIGHTFOOT",
  "text": "",
  "date": "2023-01-27"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/congressman-bennie-thompson-absolutely-endorses-mayor-lightfoot/",
  "title": "Congressman Bennie Thompson “Absolutely” Endorses Mayor Lightfoot",
  "text": "Turning to the mayor, Thompson said, “If you want to make enemies, try to change thing’s. Was he endorsing Lightfoot, we asked after his speech? “Absolutely,” Thompson said. Wading into Chicago politics: Thompson went on to needle opponents to Lightfoot’s plan to open a Chicago school to migrants.“We are now the melting pot in this city. We are Black and brown, and we are everything. So we have to get along,” Thompson said, adding that when migrants “out of desperation” land in Chicago “we have to open our arms and say welcome. If we have to open a school to welcome immigrants, then we open the school — especially if the school is empty. You understand?”",
  "date": "2023-01-25"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-city-and-community-leaders-cut-ribbon-to-officially-unveil-the-public-safety-training-center/",
  "title": "MAYOR LIGHTFOOT, CITY AND COMMUNITY LEADERS CUT RIBBON TO OFFICIALLY UNVEIL THE PUBLIC SAFETY TRAINING CENTER",
  "text": "\nCHICAGO — Today, Mayor Lori E. Lightfoot joined Chicago Police Department Superintendent David O. Brown, Chicago Fire Department Commissioner Annette Nance-Holt, Alderman Emma Mitts (37th Ward), Dr. Elizabeth Lockhart, and community partners to cut the ribbon on the recently completed Public Safety Training Center (PSTC). This cutting-edge training center will provide the cities’ first responders with the most modern facilities to hone their skills for emergency response situations, investigations, and tactical operations.\n“To make Chicago the safest big city in the country, we must invest in both our first responders and in our neighborhoods,” said Mayor Lightfoot. “The Public Safety Training Center is a demonstration of these commitments, and was created in partnership with public safety experts and the community in mind. The PSTC will help deliver a new generation of police officers and firefighters, and the businesses developed around it will contribute to more meaningful investments in the West Humboldt Park neighborhood.”\nThe Public Safety Training Center features a six-story tower with each floor simulating different environment firefighters encounter daily, including apartments, hotels, and office buildings. The center also includes an indoor and outdoor scenario village replicating a four-way intersection common in most neighborhoods. The departments will use this scenario village to train first responders on how to respond to various emergency calls.\n“Opening the new Public Safety Training Center represents a public safety milestone for the city of Chicago with collaborative education, and sophisticated training and tools for the next generation of first responders and current police officers alike,” said CPD Superintendent David O. Brown. “This campus is both an investment in the community and active part of this community that will engage and inspire youth and grow trust while connecting residents.”\n“Having proudly served 32 years so far in the fire department, I understand fully what a firehouse can mean to a community and I’m confident this facility will be an anchor in this neighborhood,” said Commissioner Nance-Holt. “Sharing this location with Boys & Girls Club is truly a blessing. As children are coming and going from their club activities, they might get a chance to see first responders who they can relate to and hopefully spark a dream to one day serve this great city as a Firefighter, Paramedic, or Police Officer.”\nThe facility sits on a 30.4-acre former rail yard that, prior to the City’s purchase in 2017, had been sitting vacant for more than 40 years. In addition to the main academy building, the site will also host two minority-owned restaurants, Peach’s and Culvers, as well as a 27,000-square-foot Boys and Girls Club that are all slated to open this summer. The purpose of these establishments is to provide an economic pillar point for the community. Combined, the PSTC, the Boys and Girls Club, and the Culver’s and Peach’s restaurants represent approximately $170M in public and private investments in this community.\n“I’m proud the Public Safety Training Center is in West Humboldt Park and that our community will play a role in serving hundreds of recruits tasked with protecting the city,” said Alderman Emma Mitts (37th Ward). “The PSTC is critical to public safety and training firefighters and police officers. Additionally, the facility is attracting businesses like Culver’s and Peach’s restaurants and organizations like the Boys and Girls Club to our neighborhood, ensuring more job opportunities for our residents.”The PSTC is situated between two Invest South/West – one in Austin and the other in West Humboldt Park – that will see $95M in new private investment in the coming years. This investment will radiate from this building toward Austin and West Humboldt Park, and vice versa, connecting neighborhoods and creating a lively corridor with new businesses, living-wage jobs, and better housing.",
  "date": "2023-01-25"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-cta-and-cps-announce-cta-elevating-futures-scholarship-fund-is-now-seeking-applications-from-cps-high-school-students/",
  "title": "Mayor Lightfoot, CTA and CPS Announce “CTA Elevating Futures Scholarship Fund” Is Now Seeking Applications from CPS High School Students",
  "text": "Created in partnership with the Walsh-Fluor Design-Build team — the contractor for CTA’s historic $2.1 billion Red and Purple Modernization (RPM) Phase One Project — the scholarship program provides aid to students who plan to pursue four-year degrees in construction management, civil engineering, industrial engineering or systems engineering. Specifically, the scholarship program was created to help economically disadvantaged students to pursue an education in fields that historically create barriers for low-income students. The unique program provides $5,500 per year for four years, mentoring support and guidance in career development opportunities.“It’s important as a city that we invest in our youth and prepare them to be leaders of tomorrow,” said Mayor Lightfoot. “This innovative scholarship program provides students from low-income backgrounds the opportunity to realize their potential to the fullest.”“With every CTA project, we are committed to creating opportunity and promoting inclusion for Chicagoans across the city,” said CTA President Dorval R. Carter, Jr. “We are pleased to partner with Walsh-Fluor to offer these opportunities to students interested in careers in transportation, construction and engineering.”“We are excited to offer this scholarship to our committed and talented class of 2023,” said CPS CEO Pedro Martinez. “Elevating Futures gives these students the opportunities they need to succeed and reflects a city-wide commitment to support our rising innovators and leaders.”“These scholarship recipients are not only receiving financial and academic assistance, but they’re also getting work experience as interns in the construction and engineering fields,” Walsh-Fluor Project Executive David Shier said. “Our intent is for this program to provide everything these students need to launch successful careers.”“The Elevating Futures Scholarship Fund has gone above and beyond to provide our financially under-resourced and first-generation Scholars with the financial supports, mentoring and internship opportunities they need for long-term success in science, technology, engineering and math,” said Jeffery Beckham, Jr., Chicago Scholars CEO. “Chicago Scholars is proud to partner with Walsh-Fluor and the CTA to deliver best-in-class opportunities for Chicago students.”“The Elevating Futures scholarship has allowed me to bring my dream to a reality,” said Loyola University student Axel Hernandez, a past scholarship recipient. “I’ve always wanted to go to college and I want to be the first person in my family to graduate from college, and get a degree in Business Administration and create a construction business for me and my family.”To date, eight students from across the city of Chicago, including the Back of the Yards, Bridgeport, Hegewisch, Humboldt Park, Portage Park, Rogers Park, and Austin neighborhoods, have received scholarships from the “CTA Elevating Futures Scholarship Fund,” which is administered by Chicago Scholars, a nonprofit dedicated to college access, and college-success leadership development for first-generation and low-income students in Chicago. Scholarships have been awarded to graduates of Lake View High School, Lane Tech College Prep, Gary Comer College Prep, EPIC Academy High School, William Jones College Prep, Sullivan High School, and Austin College and Career Academy.The first-of-its-kind CTA initiative provides scholarships, mentoring support and career guidance for under-resourced college students. The scholarship program is administered by Chicago Scholars, a nonprofit dedicated to college access, college success and leadership development for first-generation and low-income students in Chicago.This will be the fourth and final round of this scholarship. Donated by Walsh-Fluor to help offset tuition costs for CPS graduates, the $250,000 ‘CTA Elevating Futures Scholarship Fund’ will have provided 10 financial aid scholarships from 2020 through 2023. The students who are awarded scholarships are also eligible to apply for paid summer internships with Walsh-Fluor and the CTA.Applications are due March 1, 2023.  For more information about this program, visit CTA’s website at transitchicago.com/rpm/workforce-opportunities or Chicago Scholars’ website at http://chicagoscholars.org/elevatingfutures",
  "date": "2023-01-24"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-launches-administrative-debt-relief-pilot-program-providing-additional-financial-relief-to-chicago-residents/",
  "title": "MAYOR LIGHTFOOT LAUNCHES ADMINISTRATIVE DEBT RELIEF PILOT PROGRAM, PROVIDING ADDITIONAL FINANCIAL RELIEF TO CHICAGO RESIDENTS",
  "text": "CHICAGO — Today, Mayor Lori E. Lightfoot and City Comptroller Reshma Soni launched the 2023 Administrative Debt Relief (ADR) Pilot Program. Available immediately, the program provides a course for Chicagoans mired in debt stemming from Administrative Hearing violations — some of which disproportionately impact low-income communities and are associated with higher fees than other municipal debt.  \n“Like many major cities nationwide, Chicago’s fines and fees structure had been historically regressive, but my administration continues to prioritize providing pathways for our residents to get out of debt into economic stability,” said Mayor Lightfoot. “The Administrative Debt Relief Pilot Program builds upon the successes of several widely used existing debt-relief programs that helped to lift heavy financial burdens for tens of thousands of Chicagoans. I look forward to the implementation of this program that will move us closer to our ultimate goal of alleviating poverty in our city.” \nAdministrative Hearing debts include but are not limited to those resulting from violations issued by the Departments of Streets and Sanitation, Police, Buildings, and Business Affairs and Consumer Protection. The program builds on the success of the City’s ongoing fines and fees reforms and debt relief efforts, including the Clear Path Relief (CPR) program for vehicle tickets and the Utility Billing Relief (UBR) program for sewer and water bills. \n“Since Mayor Lightfoot came into office in 2019, the City has implemented a vast array of fines and fees reforms to help individuals come into compliance. The ADR program is yet another way we are providing an opportunity to help ease the financial burden of debt weighing down individuals and small businesses,” said City Comptroller Reshma Soni. “Our goal is to help pave a viable road to economic stability. This progressive reform offers two options for those seeking to come into compliance but may have distinct needs in order to fulfill their financial obligations.” \nThe Department of Finance is tasked with administering each of the program’s two phases. The first, Standard Relief, does not require an application and allows individuals or businesses to pay the original fine amount in full, or enroll in a payment plan. The second phase, Hardship Relief, allows income-eligible applicants to receive a substantial discount on their original debt: \nStandard Relief Hardship Relief:  \nFines and fees reform has been a priority of Mayor Lightfoot since taking office in 2019. Traditional municipal fines and fees models are regressive and disproportionately burden low-income communities and communities of color, contributing to economic inequity and perpetuating cycles of poverty. \nUnder Mayor Lightfoot’s leadership, Chicago has become a national exemplar in fines and fees reform and was among the first cities to consider the financial capabilities of its residents when assessing fines and fees. Reforms have been made with input from advocacy groups and city departments, as well as the Fines and Fees Access Collaborative, formed in 2018 and led by the City Clerk’s Office. Accomplishments include:  \nVisit Chicago.gov/newstartchicago to learn more about, or enroll, in the Administrative Debt Relief program and other programs.  \n                ",
  "date": "2023-01-19"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/international-alliance-of-theatrical-stage-employees-local-762-of-chicago-broadcast-technicians-endorses-mayor-lori-e-lightfoots-reelection/",
  "title": "International Alliance of Theatrical Stage Employees Local 762 of Chicago Broadcast Technicians Endorses Mayor Lori E. Lightfoot’s Reelection",
  "text": "“Sports and entertainment are part of the heart and soul of Chicago culture, and in-person corporate events provide opportunities of enrichment for our business community and help boost our city’s economy. We wouldn’t be able to enjoy any of these experiences without the hardworking members of the International Alliance of Theatrical Stage Employees Local 762 of Chicago Broadcast Technicians,” said Mayor Lightfoot. “Now that live, in-person events are back in full swing in Chicago, it’s vital that we have skilled workers to bring both live and recorded events to audiences across the city, country and even the world. I’m grateful for this endorsement from IATSE Local 762, and I’m honored to have earned their confidence for my reelection.”",
  "date": "2023-01-18"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-names-monique-scott-new-24th-ward-alderman/",
  "title": "Mayor Lightfoot Names Monique Scott New 24th Ward Alderman",
  "text": "The selection of Scott came after a thorough process in which applicants were reviewed by a four-member selection committee made up of dedicated public servants and 24thward residents. The committee then recommended candidates to the Mayor.Scott will appear in front of the City Council Committee on Committees and Rules prior to a confirmation vote by the full City Council on Wednesday, June 22nd.“I am honored to be chosen to represent the hardworking men and women of the 24thward,” said Monique Scott. “Building on the work of the previous Alderman, I will strive to bring economic development and safety to my residents. At this crucial moment, I am excited to serve my community and make North Lawndale a better place for all.”In her current role, Monique serves as Park Supervisor of Recreation at a major facility for the Chicago Park District. As a supervisor, she has tripled the number of park memberships and provides strategic leadership to ensure parks are available to every resident and visitor. She also coordinates member activities and manages a diverse staff of over 20 people.Prior to her role at the Park District, Scott worked for 14 years as a health consultant for North Lawndale Christian Health Center. Since the beginning of her career, Scott has prioritized public service and giving back to her community.She also volunteers regularly with residents of all ages through Mayor Lightfoot and First Lady Amy Eshleman’s My CHI. My Future. youth initiative and the Westside Cultural Foundation.Scott holds a Bachelor of Arts from Jackson State University and a Master’s degree in Business Administration from National Louis University.“Monique Scott has the leadership skills and creative thinking to improve life for 24thward residents,” said Chairman Michelle Harris, 8thward. “After careful review of the candidates, Monique was the obvious choice to lead North Lawndale, a community she’s lived in for her entire life.”“Monique’s comprehensive understanding of North Lawndale’s challenges and opportunities make her the best choice for 24thward alderman,” said Brenda Palms Barber, President and CEO of North Lawndale Employment Network. “I was impressed by her passion for the community and am excited to see her build on the great work being done in the 24thward.”“The 24thward is in the midst of positive and long-awaited change,” said Sheila McNary, President and CEO of Advanced Care Services, Inc. “Monique will use her passion, vision, and deep knowledge of the community to be a voice for all her residents.”“I am thrilled that Monique Scott will take over as 24th Ward alderman,” said Marcus Betts, Assistant Vice Chancellor for External Engagement at UIC. “She is skilled at bringing community members together and creating spaces where residents can express concerns. Her passion for youth and vision to engage stakeholders throughout the entire ward is remarkable. I look forward to what she will accomplish in this new role.”",
  "date": "2022-06-21"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-announces-re-election-campaign/",
  "title": "Mayor Lightfoot Announces Re-Election Campaign",
  "text": " “Of course there are tough challenges ahead. We have a lot of work to do, because change just doesn’t happen overnight. But together, we will make our city safer, fairer, and more equitable for all. Now, let’s get back to work.”Since assuming office following her historic election in 2019, Mayor Lightfoot has undertaken an ambitious agenda of expanding opportunity and inclusive economic growth across Chicago’s neighborhoods and communities. Mayor Lightfoot has:Following the announcement of her reelection bid for Chicago mayor, Mayor Lori E. Lightfoot also announced a five-tour stop throughout Chicago on Wednesday, highlighting her accomplishments from her first term and speaking to her vision for the future.In her campaign announcement video, Mayor Lightfoot reiterated her commitment to solving the tough problems Chicago faces.",
  "date": "2022-06-08"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/mayor-lightfoot-launches-5-3-million-program-to-protect-homes-and-businesses-with-private-security-devices/",
  "title": "Mayor Lightfoot Launches $5.3 Million Program to Protect Homes and Businesses With Private Security Devices",
  "text": "Starting today, the City of Chicago will provide select rebates to cover costs associated with outdoor security camera systems, cloud storage for video footage, outdoor motion-sensor lighting, vehicle GPS trackers, and subscription costs. The program is open to all Chicago residents, businesses, religious institutions, and nonprofit organizations. Tenants are also welcome to apply for the rebate, provided they have received consent from the property owner.Anyone who meets the eligibility criteria below may receive reimbursement for:“We’ve been engaging with partners across the city and heard that residents, business owners, and community leaders want these resources. They want to help communities by increasing lighting and solving crimes,” said Tamara Mahal, CSCC Chief Coordination Officer. “We’re listening to community and working to reduce barriers and equip Chicagoans with the tools they need to protect their property and feel safe.”All applicants who successfully complete their application will be reimbursed within 90 days after application approval. To be eligible for any qualifying rebates, the following requirements must be met:Applicants who are interested in aiding the Chicago Police Department (CPD) during criminal investigations have the option to register their camera system at chicagopolice.org/cameraregistration. Registration of the camera system location with the CPD is not required to participate in the Home and Business Protection Program. For residents who decide to register their cameras, CPD will not have direct access to the camera system and cannot access camera footage without consent. By registering, residents simply allow CPD to request camera footage in the event of a crime. Residents reserve the right to refuse access to camera footage at all times.“Working with our communities across Chicago is the only way we can strengthen public safety,” said Glen Brooks, CPD Director of Community Policing. “By registering your camera with CPD, it will help detectives solve crimes more efficiently and take violent offenders off the street quicker.”The program is first-come, first-serve, and open to residents and business owners throughout Chicago. In order to ensure those who live in communities experiencing higher levels of violence have access to private security devices, the City will partner with community-based organizations to distribute private security equipment in the 15 communities that are considered priority based on historical trends of violence:Only security devices purchased on or after Monday, June 6, qualify for reimbursement. No rebates will be provided for private security equipment purchased prior to this date. Installation costs of cameras, lighting, and GPS tracking devices are also not eligible for reimbursement. Additional criteria for security camera, lighting, and vehicle GPS Tracking Device rebates can be found at Chicago.gov/HBPP.",
  "date": "2022-06-07"
 },
 {
  "candidate_id": "cand_ll",
  "name_tokens": "Lightfoot’s",
  "announcement_date": "7-Jun-22",
  "newspaper_id": "news_cd",
  "url": "https://chicagodefender.com/international-alliance-of-theatrical-stage-employees-local-762-of-chicago-broadcast-technicians-endorses-mayor-lori-e-lightfoots-reelection/",
  "title": "International Alliance of Theatrical Stage Employees Local 762 of Chicago Broadcast Technicians Endorses Mayor Lori E. Lightfoot’s Reelection",
  "text": "“Sports and entertainment are part of the heart and soul of Chicago culture, and in-person corporate events provide opportunities of enrichment for our business community and help boost our city’s economy. We wouldn’t be able to enjoy any of these experiences without the hardworking members of the International Alliance of Theatrical Stage Employees Local 762 of Chicago Broadcast Technicians,” said Mayor Lightfoot. “Now that live, in-person events are back in full swing in Chicago, it’s vital that we have skilled workers to bring both live and recorded events to audiences across the city, country and even the world. I’m grateful for this endorsement from IATSE Local 762, and I’m honored to have earned their confidence for my reelection.”",
  "date": "2023-01-18"
 }
]